Revit.Elements.FloorType.#ctor(Autodesk.Revit.DB.FloorType)
Construct from an existing Revit Element
type:

Revit.Elements.FloorType.IsFoundationSlab
Returns whether the element FloorAttributes type is FoundationSlab.

Revit.Elements.FloorType.GetStructuralMaterial
Gets the structural material of the FloorType.
Returns: Returns the material that defines the element's structural analysis properties.

Revit.Elements.FloorType.GetThermalProperties
The calculated and settable thermal properties of the FloorType
Value of absorptance.
The heat transfer coefficient value (U-Value).
Value of roughness.
The calculated thermal mass value.
The calculated thermal resistance value (R-Value).